<?php
// +----------------------------------------------------------------------
// | 多语言设置
// +----------------------------------------------------------------------

return [
    // 默认语言
    'default_lang'    => env('lang.default_lang', 'zh-cn'),
    // 允许的语言列表
    'allow_lang_list' => [],
    // 多语言自动侦测变量名
    'detect_var'      => 'lang',
    // 是否使用Cookie记录
    'use_cookie'      => true,
    // 多语言cookie变量
    'cookie_var'      => 'think_lang',
    // 扩展语言包
    'extend_list'     => [],
    // Accept-Language转义为对应语言包名称
    'accept_language' => [
        'zh-hans-cn' => 'zh-cn',
    ],
    // 是否支持语言分组
    'allow_group'     => false,


    // 12区县
    'area'          =>[
        1=>'榆阳区',
        2=>'横山区',
        3=>'神木市',
        4=>'府谷县',
        5=>'靖边县',
        6=>'定边县',
        7=>'绥德县',
        8=>'米脂县',
        9=>'佳县',
        10=>'吴堡县',
        11=>'清涧县',
        12=>'子洲县',
    ],
];
